
''''''

# 1,成绩判定
# 	大于85 优秀
# 	大于等于75小于等于85 良好
# 	大于等于60小于75 及格
# 	小于60  不及格



# 2,判断一个年份是闰年还是平年；
# （1.能被4整除而不能被100整除.（如2004年就是闰年,1800年不是.）
#   2.能被400整除.（如2000年是闰年））



# 3,输入一个月份，然后输出对应月份有多少天，将天数输出(不考虑闰年)
# 比如：
# 输入 6 输出为30
# 输入 2 输出为28



# 4. 开发一款软件，根据公式（身高-108）*2=标准体重，可以有10斤左右的浮动。
# 来观察测试者体重是否合适, 输入真实身高，真实体重


# 5, 入职薪水10K，每年涨幅入职薪水的5%，50年后工资多少？


# 6, 为抵抗洪水，战士连续作战89小时，编程计算共多少天零多少小时？


# 7, 给定一个5位数，分别把这个数字的万位， 千位，百位、十位、个位算出来并显示。如： 34567


# 8.分别输入某年某月某日，判断这一天是这一年的第几天？（考虑闰年） (*****)
# year, month， day
# 提示： 使用多个if单分支



# 9,输入一个时间，输出该时间的下一秒： (*****)
# 	如：23:59:59， 输入：hour, min, sec
# 	输出 0: 0: 0






