

# 位运算符（扩展， 了解）
#   &位与， |位或， ~非， ^位异或，>>右移， <<左移

# &
a = 10          # 1010
b = 9           # 1001
print(a & b)    # 1000 -> 8

# |
a = 10          # 1010
b = 9           # 1001
print(a | b)    # 1011 -> 11

# ~
print(~10)      # 00000000 00000000 00000000 00001010
                # 11111111 11111111 11111111 11110101  补码
                # 10000000 00000000 00000000 00001011  原码 -11

# ^ 异或： 相同为0，不同为1
a = 10          # 1010
b = 9           # 1001
print(a ^ b)    # 0011 -> 3

# >>
# <<
a = 10  # 1010
        #   10 10
print(a >> 2)  # 10
print(a << 2)  # 101000


# 赋值运算符
# =， +=, -=, *=...
a = 10

# 自加，自减
a = a + 1
a += 1
a /= 2
a -= 2

# 成员运算符: in , not in
# 身份运算符：is , is not

# 运算符优先级
# 万能的方式，使用括号()， ()可以提升优先级
#  * / 大于 + -
#  not 大于 and 大于 or


# Python没有三目运算符： ? :
# 三元运算符： 三个操作数
# 二元运算符： 2个操作数
# 一元运算符： 1个操作数



