

# 1.简述必需参数、关键字参数、默认参数、不定长参数的区别

# 2.写函数，计算传入字符串中单个【数字】、【字母】、【空格] 以及 【其他】的个数

# 3.写函数，判断用户传入的参数（字符串、列表、元组）长度是否大于5


# 4.写函数，检查用户传入的对象（字符串、列表、元组）的每一个元素是否含有空内容("", " ", None)。
# ['    ', '', ' ', None]

# 5.写一个函数，识别字符串是否符合python语法的变量名
#   数字字母下划线，且不能以数字开头，不能使用关键字
# import keyword
# keyword.kwlist

# 6.定义一个函数，传入不定个数的数字，返回所有数字的和


# 7, 写一个函数计算1到n的和, 并返回结果打印出来;(n为函数参数)

# 8, 写一个函数计算n的阶乘,并返回结果打印出来

# 9, 写一个函数计算两个数的最小公倍数; 并返回结果打印出来

# 10, 写一个函数判断一个年份是不是闰年

# 11, 年月日分别为自定义函数的参数，判断某一个日期是否为合法的日期;
# 	    如: 2018年12月33日不是合法的日期
# 	        2018年11月13日是合法的日期





