

# 数据类型
#   Number(int,float)
#   String
#   Boolean
#   None
#   list
#   dict
#   tuple
#   set
#   bytes

#  type(): 判断数据类型
#  id(): 获取内存地址

#  变量
#   age = 10
#   a=b=10
#   a,b = 1,2
#
#   删除变量
#   del a
#
#   变量的标识符
#     1，数字字母下划线组成，且不能以数字开头
#     2，不能使用关键字
#     3， 区分大小写
#     4， 尽量见名思意  （多个单词使用下划线_连接or使用驼峰原则）
#
#   运算符
#     算术运算符
#       + - * / %  //, **
#     比较运算符
#       >,>=,<,<=, ==, !=
#       字符串比较：使用字符的ASCII码进行比较
#     逻辑运算符
#       and  or  not
#     位运算符(了解)：
#       &，|，^, ~, <<,>>
#     赋值运算符
#       =， +=，-=，*=，/=,%=,//=,**=
#
#   If分支语句
#       单分支： if
#       双分支： if-else
#       多分支： if-elif..-else



